package analitics

import (
	mapset "github.com/deckarep/golang-set/v2"
	"strings"
)

var serviceWords = mapset.NewSet("в", "и", "не", "а", "но", "что", "это", "с", "я",
	"на", "за", "они", "она", "он", "то", "от", "бы", "если", "ты", "ну", "нету", "была",
	"там", "ли", "или", "да", "к", "у", "все", "даже", "есть", "для", "давай", "же", "надо",
	"конечно", "которые", "было", "те", "свою", "мне", "вообще", "по", "где", "кто", "его", "из",
	"можно", "либо", "куда", "уже", "только", "самые", "должны", "пока", "их", "как", "так", "со", "чем", "про",
	"чо", "очень", "еще", "ещё", "так", "до", "нет", "про", "вот", "ни", "когда", "чтобы", "потом", "сколько", "будет",
	"тут", "этого", "точно", "хоть", "понял", "раз", "мы", "прям", "меня", "потому", "что-то", "нас", "через", "вы",
	"теперь", "тебе", "поэтому", "лучше", "почти", "вроде", "делать", "больше", "всё", "сейчас", "такое", "них",
	"кстати", "хотя", "может", "тебя", "тоже", "без", "вас", "который", "зачем", "буду", "себе", "сделать",
	"почему", "кажется", "больше", "просто", "o", "о", "by", "in", "ok", "of", "to", "and", "могу", "знаю", "the", "хочу",
	"был", "себя", "тогда", "после", "такой", "сегодня", "быть", "всегда", "всех", "него", "сразу", "ж", "под", "ничего",
	"этом", "ему", "много", "че", "чё", "какой", "во", "щас", "были", "при", "этот", "типа", "ладно", "какой", "завтра",
	"весь", "тот", "простой")

func (r *Service) lemma(word string) string {
	return r.lemmatizer.Lemma(strings.Trim(strings.ToLower(word), "\n.,)(-—/_?!* "))
}

func (r *Service) filterService(word string) (string, bool) {
	word = r.lemma(word)
	if word == "" || len(word) < 2 || serviceWords.Contains(word) {
		return word, false
	}

	return word, true
}
